fun main(){
   val sec=2860
    agoToText(sec)
}
fun agoToText( sec:Int) {
when(sec){
    in 0 .. 60 -> print("был(а) в сети только что")
    in 61 .. 60 * 60 ->
        if(( sec/60)%10 ==0 || (sec/60)%10>=5  ||(sec/60)==11 )
            print("был(а) в сети "+(sec/60)+" минут назад")
        else if( (sec/60)!=11 && (sec/60)%10<=1)
            print("был(а) в сети "+(sec/60)+" минуту назад")
        else
        print("был(а) в сети "+(sec/60)+" минуты назад")


    in 60 * 60 + 1 .. 24 * 60 * 60 -> print("был(а) в сети "+ (sec/3600)+" часов назад")
    in 24 * 60 *60 +1 .. 2 *24 * 60 *60 ->print("был(а) в сети сегодня")
    in  2 *24 * 60 * 60 + 1 .. 3 *24 * 60 *60 ->print("был(а) в сети вчера")
    else ->print("был(а) в сети давно")

}
}
