fun main(){
   val sec= 278000
    agoToText(sec)
}
fun agoToText( sec:Int)
{
when(sec){
    in 0 .. 60 -> print("был(а) в сети только что")
    in 61 .. 60 * 60 ->print("был(а) в сети "+(sec/60)+" минут назад")
    in 60 * 60 + 1 .. 24 * 60 * 60 -> print("был(а) в сети "+ (sec/3600)+" часов назад")
    in 24 * 60 *60 +1 .. 2 *24 * 60 *60 ->print("был(а) в сети "+ (sec / (24 * 60 *60 ))+" сегодня")
    in  2 *24 * 60 * 60 + 1 .. 3 *24 * 60 *60 ->print("был(а) в сети вчера")
    else ->print("был(а) в сети давно")

}
}
